status_msg = {
    200:'成功',
    10000:'数据不完整',
    10011:'用户名不合法',
    10012:'密码不合法',
    10013:'两次输入的密码不一致',
    10014:'手机号码不正确',
    10015:'邮箱不正确',
    10016:'请先登录后使用',
    10017:'token不可用',
    10018:'修改用户错误',
    10019:'删除用户错误',
    10020:'修改角色不存在',
    10021: '删除权限不存在',
    10022: '没有此属性',
    10023: '未上传文件',
    10024: '文件格式不符合规范',
    20000:'异常错误'
}

def to_dict_msg(status=200, data=None, msg = None):
    return{
        'status': status,
        'data': data,
        'msg': msg if msg else status_msg.get(status)
    }
